from flask import Flask, render_template
app = Flask(__name__)
@app.route('/')


def index():
    return render_template('index.html')
@app.route('/test')


def idk():
    return render_template('idk.html')
@app.route('/new')

def test():
    return '''
    <!DOCTYPE html>
<html>
    <head>
        <title>Himalayas</title>
    </head>
    <body>
    <a href='http://127.0.0.1:5000/test'>Минула сторінка</a>
        <h1></h1>
        <h3>Гімала́ї — найвищі гори на Землі, розташовані в Південній Азії між Тибетським нагір'ям на півночі та Індо-Гангською рівниною на півдні. У ширшому розумінні поширюються на Каракорум, Гіндукуш, Тоба Какар і на багато інших невеликих хребтів, що розпочинаються від Паміру. Розташовані на території сучасних Китаю, Індії, Непалу, Бутану та Пакистану. Довжина системи становить близько 2500 км, середня висота — близько 6000 м.</h3>
        <img src="https://cdn.mapme.club/images/16033/16033-ti39nq-b.jpg">
        
        <h2>Країни, в яких розташовуються Гімалаї:</h2>
        <h3>Китайська Народна Республіка</h3>
        <h3>Непал</h3>
        <h3>Афганістан</h3>
        <h3>Пакистан</h3>
        <h3>Бутан</h3>
        <h3>Індія</h3>
        
        <h2>Загальні відомості про Гімалаї</h2>
        <h3>Найвища точка Гімалаїв — Джомолунгма (або Еверест) заввишки 8848 м. Для порівняння — Аконкагуа в Андах, що є найвищою вершиною за межами Азії, має висоту 6962 м, тоді як Гімалаї мають більше 100 вершин понад 7200 метрів і 10 вершин висотою понад 8000 м.</h3>
        <h3>Гімалаї підносяться над Індо-Гангською рівниною трьома ярусами — гори Шивалік (Передгімалаї), Малі Гімалаї (хребти Пір-Панджал, Дхаоладхар та ін.) і Великі Гімалаї, які відділені від двох попередніх структур ланцюгом поздовжніх западин. Великі Гімалаї поділяють на Ассамські, Непальські, Кумаонські та Пенджабські Гімалаї. Для Великих Гімалаїв характерні гребені альпійського типу, значні висотні контрасти, потужне заледеніння (площа льодовиків понад 33 тис. км²).</h3>
        <h3>Північні, більш короткі схили, які прилягають до порівняно вищого Тибетського нагір'я, мають меншу відносну висоту, ніж південні. Вони обмежені долинами річок Цангпо (Брахмапутра), Інд. У Гімалаях беруть початок основні річки Азії — Інд, Ганг, Брахмапутра. Південні схили Гімалаїв знаходяться під сильним впливом літнього мусону, характерними є сильні опади, добре розвинена висотна поясність фауни. На північних схилах вплив мусону слабшає, домінують гірські степи, напівпустелі. Вище 5000 м — ландшафти гляціально-нівального поясу.</h3>
        <img src="https://24tv.ua/resources/photos/news/201706/831036.jpg?v=1661282430000">
        <h4>(Гора Еверест)</h4>
    </body>
</html>
    '''

app.run(debug=True)